---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.AutoGlazingFailed
source: html/4c14fd5d-451f-2a8e-bba8-0b21f1af9697.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.AutoGlazingFailed Property

Failure in Auto-Glazing region computation.

## Syntax (C#)
```csharp
public static FailureDefinitionId AutoGlazingFailed { get; }
```